{
    "version": "https://jsonfeed.org/version/1",
    "title": "Coomb Blog",
    "description": "",
    "home_page_url": "https://blog.coomb.co",
    "feed_url": "https://blog.coomb.co/feed.json",
    "user_comment": "",
    "author": {
        "name": "Pattara Prachumpai"
    },
    "items": [
        {
            "id": "https://blog.coomb.co/first-post/",
            "url": "https://blog.coomb.co/first-post/",
            "title": "WP Rocket ปลั๊กอินติดจรวดให้เว็บไซต์ พร้อมวิธีตั้งค่า",
            "summary": " ใครๆก็ชอบเว็บไซต์ที่โหลดเร็วมากกว่าเว็บที่โหลดช้าใช่มั้ยครับ แต่ความเร็วของเว็บไซต์นั้นส่งผลกระทบมากกว่าแค่ชอบหรือไม่ชอบ ความเร็วส่งผลต่อความสำเร็จของเว็บไซต์นั้นๆด้วย ในการสร้างเว็บไซต์ นอกจากความสวยงามแล้ว ความเร็วเป็นอีกสิ่งหนึ่งที่เราต้องให้ความสนใจเป็นอันดับต้นๆ สถิติได้บอกว่าผู้เยี่ยมชมเว็บไซต์กว่า 25% ไม่รอเว็บไซต์ที่โหลดช้ากว่า 4 วินาทีหรือปัจจุบันนี้อาจจะสั้นกว่านั้น เท่ากับว่าเว็บไซต์ที่โหลดช้านั้น จะมีอัตรา Bounce Rate ที่สูงซึ่งเป็นตัวบ่งชี้ว่าเว็บไซต์ไม่เป็นประโยชน์ต่อผู้เยี่ยมชมเว็บไซต์ และนั่นจะส่งผลต่ออันดับใน Search Engine ในบทความนี้เราจะมาสนทนากันครับว่า เราจะสามารถเพิ่มความเร็วให้เว็บไซต์ WordPress ผ่านการใช้ Plugin ทั้งในรูปแบบฟรีและรูปแบบเสียเงิน เข้ามาแก้ไขปัญหาในจุดต่างๆของเว็บไซต์ เพื่อให้เว็บไซต์ของเรามีความรวดเร็ว เป็นประสบการณ์การใช้งานที่ดีให้กับคนที่คลิ๊กเข้ามาชมเว็บไซต์ของเรา รูปถือเป็นไฟล์ที่ใหญ่ที่สุดในเว็บไซต์รองจากวิดีโอ เพราะฉะนั้นการย่อขนาดรูปภาพที่ใช้เป็นสิ่งแรกที่สามารถทำได้เมื่อต้องการปรับความเร็วเว็บไซต์ เราสามารถลดขนาดไฟล์ภาพที่โชว์บนเว็บไต์เราได้อย่างมาก โดยใช้เครื่องมือลดขนาดไฟล์ภาพอย่าง Squoosh เป็นโปรแกรมย่อขนาดไฟล์ภาพที่ใช้ได้ฟรี เราสามารถย่อขนาดรูปภาพ (Resize) ให้พอเหมาะ ลดขนาดไฟล์ และแปลงไฟล์ได้ เพื่อทดสอบผมได้ทำการโหลดภาพมาจาก Unsplash และจากภาพด้านล่างสังเกตุว่า จากขนาด 1&hellip;",
            "content_html": "\n  <p>\n    ใครๆก็ชอบเว็บไซต์ที่โหลดเร็วมากกว่าเว็บที่โหลดช้าใช่มั้ยครับ แต่ความเร็วของเว็บไซต์นั้นส่งผลกระทบมากกว่าแค่ชอบหรือไม่ชอบ ความเร็วส่งผลต่อความสำเร็จของเว็บไซต์นั้นๆด้วย ในการสร้างเว็บไซต์ นอกจากความสวยงามแล้ว ความเร็วเป็นอีกสิ่งหนึ่งที่เราต้องให้ความสนใจเป็นอันดับต้นๆ\n<br>\n<br>สถิติได้บอกว่าผู้เยี่ยมชมเว็บไซต์กว่า 25% ไม่รอเว็บไซต์ที่โหลดช้ากว่า 4 วินาทีหรือปัจจุบันนี้อาจจะสั้นกว่านั้น เท่ากับว่าเว็บไซต์ที่โหลดช้านั้น จะมีอัตรา Bounce Rate ที่สูงซึ่งเป็นตัวบ่งชี้ว่าเว็บไซต์ไม่เป็นประโยชน์ต่อผู้เยี่ยมชมเว็บไซต์ และนั่นจะส่งผลต่ออันดับใน Search Engine\n<br>\n<br>ในบทความนี้เราจะมาสนทนากันครับว่า เราจะสามารถเพิ่มความเร็วให้เว็บไซต์ WordPress ผ่านการใช้ Plugin ทั้งในรูปแบบฟรีและรูปแบบเสียเงิน เข้ามาแก้ไขปัญหาในจุดต่างๆของเว็บไซต์ เพื่อให้เว็บไซต์ของเรามีความรวดเร็ว เป็นประสบการณ์การใช้งานที่ดีให้กับคนที่คลิ๊กเข้ามาชมเว็บไซต์ของเรา\n  </p>\n\n  <div class=\"post__toc\">\n    <h3>โพสนี้ยาว เลือกอ่าน</h3>\n    <ul>\n      <li><a href=\"#\">ปรับขนาดรูปภาพให้เหมาะสม</a><ul><li><a href=\"#squoosh-app\">Squoosh App</a></li><li><a href=\"#shortpixel\">ShortPixel</a></li></ul></li>\n    </ul>\n  </div>\n  \n\n    <h2>\n      ปรับขนาดรูปภาพให้เหมาะสม\n    </h2>\n\n  <p>\n    รูปถือเป็นไฟล์ที่ใหญ่ที่สุดในเว็บไซต์รองจากวิดีโอ เพราะฉะนั้นการย่อขนาดรูปภาพที่ใช้เป็นสิ่งแรกที่สามารถทำได้เมื่อต้องการปรับความเร็วเว็บไซต์ เราสามารถลดขนาดไฟล์ภาพที่โชว์บนเว็บไต์เราได้อย่างมาก โดยใช้เครื่องมือลดขนาดไฟล์ภาพอย่าง\n  </p>\n\n    <h3 id=\"squoosh-app\">\n      Squoosh App\n    </h3>\n\n  <p>\n    Squoosh เป็นโปรแกรมย่อขนาดไฟล์ภาพที่ใช้ได้ฟรี เราสามารถย่อขนาดรูปภาพ (Resize) ให้พอเหมาะ ลดขนาดไฟล์ และแปลงไฟล์ได้ เพื่อทดสอบผมได้ทำการโหลดภาพมาจาก Unsplash และจากภาพด้านล่างสังเกตุว่า จากขนาด 1 MB เราสามารถลดขนาดไฟล์ได้กว่าครึ่งหนึ่งโดยคุณภาพลดลงเพียงเล็กน้อยเท่านั้น แต่ตัว Squoosh นั้นสามารถย่อไฟล์ภาพได้ครั้งละ 1 ภาพเท่านั้น\n  </p>\n\n    <h3 id=\"shortpixel\">\n      ShortPixel\n    </h3>\n\n  <p>\n    หากเรามีภาพเยอะ และไม่ต้องการที่จะทำไฟล์ภาพทีละภาพ เราสามารถใช้ Plugin อย่าง ShortPixel เพื่อปรับขนาดไฟล์ภาพของเราแบบอัตโนมัติ โดย ShortPixel มาในรูปแบบของโปรแกรม Freemium สามารถใช้ปรับไฟล์ภาพได้ฟรีเดือนละ 100 ภาพและจะต้องเสียเงินเมื่อต้องการใช้ในจำนวนที่มากขึ้น ซึ่งถือว่าคุ้มค่าเนื่องจาก ShortPixel มีความสามารถในการลดขนาดไฟล์และคงความชัดของรูปภาพได้ดี\n  </p>",
            "image": "https://blog.coomb.co/media/posts/1/khianwp-setting-cover-3-80.jpg",
            "author": {
                "name": "Pattara Prachumpai"
            },
            "tags": [
            ],
            "date_published": "2021-09-02T14:13:23+07:00",
            "date_modified": "2021-09-02T15:06:34+07:00"
        }
    ]
}
